In [21]:
import pandas as pd
import numpy as np

In [3]:
df1 = pd.DataFrame([[3,2,5], [10,0,2],[6,5,3]], columns=["사과", "자두", "포도"], index=["이성계", "김유신", "이순신"])
s1 = df1["사과"]

In [4]:
df1

     사과  자두  포도
이성계   3   2   5
김유신  10   0   2
이순신   6   5   3

In [5]:
s1

이성계     3
김유신    10
이순신     6
Name: 사과, dtype: int64

In [6]:
df1.sum()

사과    19
자두     7
포도    10
dtype: int64

In [7]:
df1.mean()

사과    6.333333
자두    2.333333
포도    3.333333
dtype: float64

In [8]:
df1.values #함수가 아니므로 ()괄호 안해도 된다

array([[ 3,  2,  5],
       [10,  0,  2],
       [ 6,  5,  3]], dtype=int64)

In [10]:
df1.index

Index(['이성계', '김유신', '이순신'], dtype='object')

In [11]:
df1.columns

Index(['사과', '자두', '포도'], dtype='object')

In [13]:
df1.values > 3

array([[False, False,  True],
       [ True, False, False],
       [ True,  True, False]])

In [14]:
df1 > 3

        사과     자두     포도
이성계  False  False   True
김유신   True  False  False
이순신   True   True  False

In [16]:
s1 > 3

이성계    False
김유신     True
이순신     True
Name: 사과, dtype: bool

In [18]:
pd.DataFrame([[3,2,5], [10,0,2], [6,5,3]],
            index=["이성계","김유신","이순신"],
            columns=["사과","자두","포도"])

     사과  자두  포도
이성계   3   2   5
김유신  10   0   2
이순신   6   5   3

In [20]:
pd.Series([3,10,6], index=["이성계","김유신","이순신"])

이성계     3
김유신    10
이순신     6
dtype: int64

In [ ]:
#1 인덱싱과 슬라이싱

In [ ]:
행, 열 [ :2, :3] 2, 3 만큼 슬라이싱

In [22]:
a = np.random.randint(0,10,24).reshape(4,6)
df = pd.DataFrame(a, index=list("가나다라"), columns=list("ABCDEF"))

In [23]:
df

   A  B  C  D  E  F
가  5  2  2  9  9  4
나  2  9  0  2  2  1
다  3  5  6  0  3  1
라  0  0  0  2  9  7

In [25]:
df[["B","C","D"]]#대괄호 인덱싱은 슬라이싱이 안되기 때문에 여러개 부를거면 리스트형식으로 넣어줘야한다

   B  C  D
가  2  2  9
나  9  0  2
다  5  6  0
라  0  0  2

In [27]:
#열과 행을 모두 사용할수 있는 loc메서드
df.loc["가","A"]

5

In [28]:
df.loc["가":"다", "A ":"E"] #행 가~다까지, 열A~E까지

   B  C  D  E
가  2  2  9  9
나  9  0  2  2
다  5  6  0  3

In [29]:
df.loc["가":"다",["A","E"]]#여기서 A~E까지가 아니라 A와 E만 가져오고싶다면 리스트형식으로 넣어주면된다

   A  E
가  5  9
나  2  2
다  3  3

In [30]:
df.loc["가":"다",["A","E","E"]]

   A  E  E
가  5  9  9
나  2  2  2
다  3  3  3

In [31]:
df

   A  B  C  D  E  F
가  5  2  2  9  9  4
나  2  9  0  2  2  1
다  3  5  6  0  3  1
라  0  0  0  2  9  7

In [34]:
df.iloc[0:3, 0:5]

   A  B  C  D  E
가  5  2  2  9  9
나  2  9  0  2  2
다  3  5  6  0  3

In [35]:
df.iloc[0:3, [1,3,3]]

   B  D  D
가  2  9  9
나  9  2  2
다  5  0  0

In [ ]:
#열 또는 행을 삭제하는 drop함수

In [36]:
df

   A  B  C  D  E  F
가  5  2  2  9  9  4
나  2  9  0  2  2  1
다  3  5  6  0  3  1
라  0  0  0  2  9  7

In [38]:
df.drop("D", axis=1)#drop은 행도 drop할 수 있고 열도 drop 할 수 있기때문에 axis를 지정해줘야한다
#axis=0행 ,  axis=1열

   A  B  C  E  F
가  5  2  2  9  4
나  2  9  0  2  1
다  3  5  6  3  1
라  0  0  0  9  7

In [43]:
#B, D, E, F열과 가나다행의 자료를 추출
df.iloc[:3, 1:].drop("C", axis=1)

   B  D  E  F
가  2  9  9  4
나  9  2  2  1
다  5  0  3  1

In [44]:
a1 = [60, 84, 80, 70, 19]
a2 = [77, 62, 95, 85, 17]
a3 = [61, 97, 72, 67, 15]
a4 = [75, 65, 95, 51, 18]
cols = ["국어", "영어", "수학", "과학", "나이"]
df = pd.DataFrame([a1, a2, a3, a4], index=list("ABCD"), columns=cols)

In [45]:
df

   국어  영어  수학  과학  나이
A  60  84  80  70  19
B  77  62  95  85  17
C  61  97  72  67  15
D  75  65  95  51  18

In [ ]:
#함수 sort_values사용법
#df.sort_values([열1,열2,...,열n], ascending=bool)

In [46]:
df.sort_values("국어")#국어성적을 기준으로 정렬, 디폴트는 오름차순

   국어  영어  수학  과학  나이
A  60  84  80  70  19
C  61  97  72  67  15
D  75  65  95  51  18
B  77  62  95  85  17

In [47]:
df.sort_values("영어", ascending=False)#ascending=False 내림차순

   국어  영어  수학  과학  나이
C  61  97  72  67  15
A  60  84  80  70  19
D  75  65  95  51  18
B  77  62  95  85  17

In [48]:
df.sort_values("수학", ascending=False)
#동점자에서는 먼저있던 행이 위로올라옴

   국어  영어  수학  과학  나이
B  77  62  95  85  17
D  75  65  95  51  18
A  60  84  80  70  19
C  61  97  72  67  15

In [49]:
#동점자가 있으니 두항목으로 정렬해보자
#수학을 먼저 정렬을하고 수학점수가 같을시에는 영어점수가 높은쪽을 위로 정렬
df.sort_values(["수학","영어"], ascending=False)

   국어  영어  수학  과학  나이
D  75  65  95  51  18
B  77  62  95  85  17
A  60  84  80  70  19
C  61  97  72  67  15

In [52]:
#수학이 동점일때 나이로 정렬을 해보자, 단 어릴수록 위로 올라가도록 해보자
#그러면 수학은 내림차순인데 나이는 오름차순
df.sort_values(["수학","나이"], ascending=[0,1]) 
#수학은 내림차순이니까 False, False대신0해도됨
#나이는 오름차순이니까 True, True대신 1

   국어  영어  수학  과학  나이
B  77  62  95  85  17
D  75  65  95  51  18
A  60  84  80  70  19
C  61  97  72  67  15

In [53]:
#broadcasting과 연산

In [ ]:
#넘파이와 판다스의 다른점
#같은자리에서 연산하는게 넘파이 연산
#같은 인덱스와 컬럼들을 대상으로 연산, 라벨이 중요

In [54]:
a1 = [[1,2,3], [4,5,6,], [7,8,9]]
df1 = pd.DataFrame(a1, columns=list("ABC"), index=list("가나다"))
df2 = df1.reindex(columns=list("BCA"), index=list("나다가")).copy()
sr1 = df1.loc["가"]
df3 = df1.iloc[:2,:2]

In [56]:
df1*df1

    A   B   C
가   1   4   9
나  16  25  36
다  49  64  81

In [57]:
df1 + df2

    A   B   C
가   2   4   6
나   8  10  12
다  14  16  18

In [59]:
df1

   A  B  C
가  1  2  3
나  4  5  6
다  7  8  9

In [60]:
df3

   A  B
가  1  2
나  4  5

In [58]:
df1 + df3 #df3에서 없는 부분이 NaN으로 처리되어 연산
#판다스의 연산은 함수가 아니라 연산자로 쉽게 연산이 된다
#함수는 인자를 넣을때 사용

     A     B   C
가  2.0   4.0 NaN
나  8.0  10.0 NaN
다  NaN   NaN NaN

In [ ]:
#df.add(df2, axis=축, fill_value=NaN대신 넣을 값)

In [62]:
#df3에 없는 부분은 사실 NaN이 아니라 구매량이 없다 0으로두고 연산하고싶을때 fill_value
df1.add(df3, fill_value=0) #df3없는 부분 0으로 채우고 연산하게 된다

     A     B    C
가  2.0   4.0  3.0
나  8.0  10.0  6.0
다  7.0   8.0  9.0

In [63]:
df1

   A  B  C
가  1  2  3
나  4  5  6
다  7  8  9

In [64]:
sr1

A    1
B    2
C    3
Name: 가, dtype: int64

In [65]:
df1 + sr1 #디폴트는 위에서 아래로 axis=1

   A   B   C
가  2   4   6
나  5   7   9
다  8  10  12

In [68]:
df1.add(sr1, axis=0)

    A   B   C
A NaN NaN NaN
B NaN NaN NaN
C NaN NaN NaN
가 NaN NaN NaN
나 NaN NaN NaN
다 NaN NaN NaN

In [ ]:
#판다스에서 강력한 툴 중 하나인 필터
#필터에 해당하는 boolean indexing

In [ ]:
#boolean indexing: True, False의 bool자료형으로 하는 indexing

In [69]:
a1 = [60, 84, 80, 70, "문예부"]
a2 = [77, 62, 95, 85, "과학부"]
a3 = [61, 97, 72, np.nan, "농구부"]
a4 = [75, 65, 95, np.nan, "다도부"]
cols = ["국어", "영어", "수학", "과학", "소속"]
b1 = ["문예부", "과학부", "다도부"]
df = pd.DataFrame([a1, a2, a3, a4], index=list("ABCD"), columns=cols)

In [71]:
df

   국어  영어  수학    과학   소속
A  60  84  80  70.0  문예부
B  77  62  95  85.0  과학부
C  61  97  72   NaN  농구부
D  75  65  95   NaN  다도부

In [70]:
#영어성적이 80점보다 높은 학생들의 데이터만 추출하기
df["영어"]

A    84
B    62
C    97
D    65
Name: 영어, dtype: int64

In [72]:
df["영어"] > 80 #데이터프레임과 시리즈는 손쉽게 bool형태로 바꿀수 있다

A     True
B    False
C     True
D    False
Name: 영어, dtype: bool

In [74]:
df.loc[df["영어"] > 80]

   국어  영어  수학    과학   소속
A  60  84  80  70.0  문예부
C  61  97  72   NaN  농구부

In [75]:
df.loc[df["영어"] > 80, "국어":"과학"] #소속이 필요없을때 성적만보고싶을때 슬라이싱
#df영어는 80보다 크다 이부분은 조건문으로 변수로 지정하고 따로 떼어쓰는 습관을 들이는게 좋다

   국어  영어  수학    과학
A  60  84  80  70.0
C  61  97  72   NaN

In [76]:
cond1 = df["영어"] > 80 #조건이 여럭개가 될 경우 이렇게 사용하는것이 편리하다
df.loc[cond1, "국어":"과학"]

   국어  영어  수학    과학
A  60  84  80  70.0
C  61  97  72   NaN

In [78]:
#국어성적이 60점보다 높으면서 수학성적이 75점 초과인 사람을 추출
cond1 = df["국어"] > 60     #논리연산자 and - &, or - |, not - ~
cond2 = df["수학"] > 75
df.loc[cond1 & cond2]

   국어  영어  수학    과학   소속
B  77  62  95  85.0  과학부
D  75  65  95   NaN  다도부

In [ ]:
#관계연산자를 이용해서 시리즈 손쉽게 bool(Ture,False)형 시리즈로 변경 되는것을 알수있었다
#다른방법으로 True,False 뽑아낼 수 있는 함수 isin과 isnull
#isnull:NaN이다, NaN값이 있으면 True아니면 False로 반환하는 함수

In [82]:
df

   국어  영어  수학    과학   소속
A  60  84  80  70.0  문예부
B  77  62  95  85.0  과학부
C  61  97  72   NaN  농구부
D  75  65  95   NaN  다도부

In [81]:
df["과학"].isnull()

A    False
B    False
C     True
D     True
Name: 과학, dtype: bool

In [83]:
df.loc[~df["과학"].isnull()] #NaN인 값이 필요없을때 
#dropna:NaN인 행이나 열을 삭제하는 함수
#dropna로 할수있지만 isna가 의미가있다 
#dropna는 단순히 NaN값을 없앨때는 유용하지만, 여러가지 조건에NaN이냐 아니냐는 isnull이 유용

   국어  영어  수학    과학   소속
A  60  84  80  70.0  문예부
B  77  62  95  85.0  과학부

In [84]:
#C는 결석자, D는 수학이 90점 이상이라 과학시험 면제자
df.loc[~df["과학"].isnull() | (df["수학"]>90)]

   국어  영어  수학    과학   소속
A  60  84  80  70.0  문예부
B  77  62  95  85.0  과학부
D  75  65  95   NaN  다도부

In [85]:
df

   국어  영어  수학    과학   소속
A  60  84  80  70.0  문예부
B  77  62  95  85.0  과학부
C  61  97  72   NaN  농구부
D  75  65  95   NaN  다도부

In [86]:
#isin 함수를 이용해 문예부와 과학부와 다도부의 데이터만 추출하라
cond1 = df["소속"] == "문예부"
cond2 = df["소속"] == "과학부"
cond3 = df["소속"] == "다도부"
df[cond1 | cond2 | cond3] #이렇게 할수도있지마 isin으로 편리하게 할 수 있다

   국어  영어  수학    과학   소속
A  60  84  80  70.0  문예부
B  77  62  95  85.0  과학부
D  75  65  95   NaN  다도부

In [89]:
b1 = ["문예부", "과학부", "다도부"]

In [90]:
b1

['문예부', '과학부', '다도부']

In [93]:
#df.loc[df["소속"].isin(b1)]
df.loc[df["소속"].isin(["문예부","과학부","다도부"])]

   국어  영어  수학    과학   소속
A  60  84  80  70.0  문예부
B  77  62  95  85.0  과학부
D  75  65  95   NaN  다도부

In [ ]:
# index & columns

In [94]:
df1 = pd.DataFrame([["파이전자", 20, 30, 30, 40, "반도체"], 
                   ["썬닉스", 100, 90, 80, 100, "반도체"], 
                   ["판다센", 300, 320, 340, 0, "게임"], 
                   ["스마블", 0, 450, 300, 300, "게임"]], 
                  columns=["종목", "A팀", "B팀", "C팀", "D팀", "분류"])
s1 = pd.Series([35000, 10000, 2000, 5000], index=list(df1["종목"]))
df2 = df1.set_index("종목").iloc[:,:4].mul(s1, axis=0)
df2 = df2.reindex(["D팀", "C팀", "B팀", "A팀", "분류"], axis=1).reset_index()
df2["분류"] = df1["분류"]

In [95]:
df1

     종목   A팀   B팀   C팀   D팀   분류
0  파이전자   20   30   30   40  반도체
1   썬닉스  100   90   80  100  반도체
2   판다센  300  320  340    0   게임
3   스마블    0  450  300  300   게임

In [97]:
list(df1.index)

[0, 1, 2, 3]

In [98]:
df1.columns

Index(['종목', 'A팀', 'B팀', 'C팀', 'D팀', '분류'], dtype='object')

In [ ]:
#df.set_index(값, drop=bool, append=bool, inplace=bool)

In [99]:
df1.set_index("종목") # 기본 디폴트값인 숫자 열이 탈락되고, 종목열이 인덱스가 되었다

       A팀   B팀   C팀   D팀   분류
종목
파이전자   20   30   30   40  반도체
썬닉스   100   90   80  100  반도체
판다센   300  320  340    0   게임
스마블     0  450  300  300   게임

In [101]:
df1.set_index(["분류","종목"]) #멀티인덱스로도 만들어줄 수 있다

           A팀   B팀   C팀   D팀
분류  종목
반도체 파이전자   20   30   30   40
    썬닉스   100   90   80  100
게임  판다센   300  320  340    0
    스마블     0  450  300  300

In [102]:
df1.set_index(["분류","종목"], drop=False) #drop=True가 디폴트값
#drop을 False로하면 인덱스로 만든 열을 기존 데이터프레임에서도 drop시키지 않는다

            종목   A팀   B팀   C팀   D팀   분류
분류  종목
반도체 파이전자  파이전자   20   30   30   40  반도체
    썬닉스    썬닉스  100   90   80  100  반도체
게임  판다센    판다센  300  320  340    0   게임
    스마블    스마블    0  450  300  300   게임

In [105]:
df1.set_index(["분류","종목"], append=True) 
#append하면 기존 index가 맨 앞에 살아있고 그 다음에 분류와 종목이라는 index가 추가된것

             A팀   B팀   C팀   D팀
  분류  종목
0 반도체 파이전자   20   30   30   40
1 반도체 썬닉스   100   90   80  100
2 게임  판다센   300  320  340    0
3 게임  스마블     0  450  300  300

In [109]:
df3 = df1.loc[df1["종목"] != "판다센"]
df3

     종목   A팀   B팀   C팀   D팀   분류
0  파이전자   20   30   30   40  반도체
1   썬닉스  100   90   80  100  반도체
3   스마블    0  450  300  300   게임

In [116]:
df3.reset_index()

   index    종목   A팀   B팀   C팀   D팀   분류
0      0  파이전자   20   30   30   40  반도체
1      1   썬닉스  100   90   80  100  반도체
2      3   스마블    0  450  300  300   게임

In [114]:
df3.reset_index(drop=True) #drop=False로하면 기존 인덱스 drop안한다

     종목   A팀   B팀   C팀   D팀   분류
0  파이전자   20   30   30   40  반도체
1   썬닉스  100   90   80  100  반도체
2   스마블    0  450  300  300   게임

In [117]:
df3.T #전치행렬 컬럼즈가 인덱스,인덱스가 컬럼즈 행과열이 뒤바뀐다

       0    1    3
종목  파이전자  썬닉스  스마블
A팀    20  100    0
B팀    30   90  450
C팀    30   80  300
D팀    40  100  300
분류   반도체  반도체   게임

In [119]:
df3.T.reset_index().T 
#더블전치행렬을 사용하여 index를 다루는 함수로 columns에 적용할 수 있다

          0    1    2    3    4    5
index    종목   A팀   B팀   C팀   D팀   분류
0      파이전자   20   30   30   40  반도체
1       썬닉스  100   90   80  100  반도체
3       스마블    0  450  300  300   게임

In [120]:
#인덱스 순서 바꾸기 reindex
df1

     종목   A팀   B팀   C팀   D팀   분류
0  파이전자   20   30   30   40  반도체
1   썬닉스  100   90   80  100  반도체
2   판다센  300  320  340    0   게임
3   스마블    0  450  300  300   게임

In [121]:
df1.reindex(columns=["종목","C팀","A팀","B팀","D팀","분류"])

     종목   C팀   A팀   B팀   D팀   분류
0  파이전자   30   20   30   40  반도체
1   썬닉스   80  100   90  100  반도체
2   판다센  340  300  320    0   게임
3   스마블  300    0  450  300   게임

In [123]:
df2

     종목       D팀       C팀       B팀       A팀   분류
0  파이전자  1400000  1050000  1050000   700000  반도체
1   썬닉스  1000000   800000   900000  1000000  반도체
2   판다센        0   680000   640000   600000   게임
3   스마블  1500000  1500000  2250000        0   게임

In [122]:
df1.reindex(columns=df2.columns) #df2columns를 따올수있다

     종목   D팀   C팀   B팀   A팀   분류
0  파이전자   40   30   30   20  반도체
1   썬닉스  100   80   90  100  반도체
2   판다센    0  340  320  300   게임
3   스마블  300  300  450    0   게임

In [125]:
df1.reindex(columns=["A팀","B팀","A팀","E팀"]) #reindex는 원하는대로 지정가능

    A팀   B팀   A팀  E팀
0   20   30   20 NaN
1  100   90  100 NaN
2  300  320  300 NaN
3    0  450    0 NaN

In [126]:
df1

     종목   A팀   B팀   C팀   D팀   분류
0  파이전자   20   30   30   40  반도체
1   썬닉스  100   90   80  100  반도체
2   판다센  300  320  340    0   게임
3   스마블    0  450  300  300   게임

In [127]:
df1.rename(columns={"A팀":"Ai팀", "B팀":"주식1팀"})

     종목  Ai팀  주식1팀   C팀   D팀   분류
0  파이전자   20    30   30   40  반도체
1   썬닉스  100    90   80  100  반도체
2   판다센  300   320  340    0   게임
3   스마블    0   450  300  300   게임

In [128]:
df1.rename(index={0:1, 1:2, 2:3, 3:4})

     종목   A팀   B팀   C팀   D팀   분류
1  파이전자   20   30   30   40  반도체
2   썬닉스  100   90   80  100  반도체
3   판다센  300  320  340    0   게임
4   스마블    0  450  300  300   게임

In [130]:
df1.index = [1,2,3,4]
df1

     종목   A팀   B팀   C팀   D팀   분류
1  파이전자   20   30   30   40  반도체
2   썬닉스  100   90   80  100  반도체
3   판다센  300  320  340    0   게임
4   스마블    0  450  300  300   게임

In [131]:
df2

     종목       D팀       C팀       B팀       A팀   분류
0  파이전자  1400000  1050000  1050000   700000  반도체
1   썬닉스  1000000   800000   900000  1000000  반도체
2   판다센        0   680000   640000   600000   게임
3   스마블  1500000  1500000  2250000        0   게임

In [133]:
df2.sort_index(axis=1, ascending=True)
#columns라 axis지정해줘야한다

        A팀       B팀       C팀       D팀   분류    종목
0   700000  1050000  1050000  1400000  반도체  파이전자
1  1000000   900000   800000  1000000  반도체   썬닉스
2   600000   640000   680000        0   게임   판다센
3        0  2250000  1500000  1500000   게임   스마블